Catalogs/Композиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Композиции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Композиции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем стРеквизитыИзменненыеДляВыгрузки, НормаВремениПКДРКД, ИзмененКонструктор, ПутьКФайлуПДМ;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ (РольДоступна("АдминистраторСистемы") ИЛИ омОбщиеФункции.РольПолныеПраваДоступны()) Тогда
		
		Элементы.ВыгрузитьВPDM.Видимость 	= Ложь;
		Элементы.ГруппаТЗ.Доступность 		= Ложь;
		Элементы.Конструктор.Доступность 	= Ложь;
		
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		ЗаполнитьДанныеПКД();
		омКомпозицииСервер.ПолучитьКомплектыКомпозиции(Объект.Ссылка, Комплекты);
		омКомпозицииСервер.ПолучитьПомещенияКомпозиции(Объект.Ссылка, Помещения);
		
		Если Код_в_PDM > 0 Тогда
			Элементы.ВыгрузитьВPDM.Видимость = Ложь;	
		КонецЕсли;
		
		ЗадачаВРаботе = омКонструктор.ВозможностьИзменитьКонструктора(Объект.Ссылка);
		
		Если ЗначениеЗаполнено(ЗадачаВРаботе) Тогда
			
			Элементы.Конструктор.ТолькоПросмотр				 	= Истина;	
			
		Иначе
			
			Элементы.ЗадачаВРаботе.Видимость = Ложь;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтадия) И (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Дизайнер")) Тогда
			ВидимостьКнопкиЗагрузитьТЗ(ТекущаяСтадия); 
		Иначе
			Элементы.ФормаЗагрузитьТЗ.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ВидимостьКнопкиЗагрузитьТЗ(Знач текТекущаяСтадия)

	СтадияПодтвержденияТЗ = омНастройкаПовтор.ПолучитьСтадиюПодтвержденияТЗ();
	
	ВидимостьКнопки = Ложь;
	
	Если НЕ текТекущаяСтадия = СтадияПодтвержденияТЗ Тогда
		
		СтадияТЗ = омНастройкаПовтор.ПолучитьСтадиюТЗ();
		
		
		Если текТекущаяСтадия = СтадияТЗ Тогда
			ВидимостьКнопки = Истина;
		Иначе
			Пока ЗначениеЗаполнено(текТекущаяСтадия.Родитель) Цикл
				текТекущаяСтадия = текТекущаяСтадия.Родитель;	
				Если текТекущаяСтадия = СтадияТЗ Тогда
					ВидимостьКнопки = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ФормаЗагрузитьТЗ.Видимость = ВидимостьКнопки;
	
КонецПроцедуры



Процедура ЗаполнитьДанныеПКД()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыКомплекта.НормаВремени_ПКД КАК НормаВремени_ПКД,
	|	ДатыКомплекта.ДнейПКД КАК ДнейПКД,
	|	ДатыКомплекта.КрайПКД КАК КрайПКД,
	|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
	|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
	|ИЗ
	|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.Комплект = &Комплект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
	|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", Объект.Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	Если НормаВремениПКДРКД ИЛИ ИзмененКонструктор Тогда
		
		стДанные = Новый Структура();
		стДанные.Вставить("ДнейТЗ", 			ДнейТЗ);
		стДанные.Вставить("НачалоТЗ", 			НачалоТЗ);
		стДанные.Вставить("Композиция", 		Объект.Ссылка);
		стДанные.Вставить("Проект", 			Объект.Проект);
		стДанные.Вставить("ТекущаяСтадия", 		ТекущаяСтадия);
		стДанные.Вставить("Конструктор", 		Конструктор);
		стДанные.Вставить("ИзмененКонструктор", ИзмененКонструктор);
		
		ЗаписатьИзмененияТЗНаСервере(стДанные);	
		
	КонецЕсли;
	
	НормаВремениПКДРКД = Ложь;
	ИзмененКонструктор = Ложь;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьИзмененияТЗНаСервере(стДанные)

	МенеджерЗаписей = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.Проект 		= стДанные.Проект;
	МенеджерЗаписей.Комплект 	= стДанные.Композиция;
	
	МенеджерЗаписей.Прочитать();
	
	МенеджерЗаписей.Проект 			= стДанные.Проект;
	МенеджерЗаписей.Комплект 		= стДанные.Композиция;
	МенеджерЗаписей.ДнейТЗ 			= стДанные.ДнейТЗ;
	МенеджерЗаписей.НачалоТЗ 		= стДанные.НачалоТЗ;
	МенеджерЗаписей.КрайТЗ 			= омДаты.ДобавитьДниСУчетомВыходных(стДанные.НачалоТЗ, стДанные.ДнейТЗ);
	
	МенеджерЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Комплект", стДанные.Композиция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МенеджерЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();

	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);
	КонецЦикла;
	
	МенеджерЗаписей.Период 			= ТекущаяДата();
	МенеджерЗаписей.Комплект 		= стДанные.Композиция;
	МенеджерЗаписей.ТекущаяСтадия 	= стДанные.ТекущаяСтадия;
	МенеджерЗаписей.Конструктор 	= стДанные.Конструктор;
	МенеджерЗаписей.Автор 			= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписей.Записать(); 
	
	Если стДанные.ИзмененКонструктор Тогда
		омКонструктор.ИзменитьИсполнителяВЗадаче(стДанные.Композиция, стДанные.Конструктор);
		
		СтруктуруДляИзмененияИсполнителя = омЗадачаОбщаяНаСервере.ПолучитьСтруктуруДляИзмененияИсполнителя(стДанные.Конструктор, , Истина);
		омЗадачаОбщаяНаСервере.ИзменитьИсполнителяЗадачиОбщей(СтруктуруДляИзмененияИсполнителя, стДанные.Композиция); 

	КонецЕсли;
	
КонецПроцедуры // ЗаписатьИзмененияТЗНаСервере(стДанные)

Функция ЕстьИзменениеРеквизитов(стРеквизитыИзменненыеДляВыгрузки)

 	Для каждого х Из стРеквизитыИзменненыеДляВыгрузки Цикл
		Если НЕ Объект[х.Ключ] = х.Значение  Тогда
			Возврат Истина;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ЕстьИзменениеРеквизитов()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ОсновноеПомещение.СписокВыбора.ЗагрузитьЗначения(ПолучитьПомещенияОбъекта(Объект.Проект));
	НайденоеЗначение = Элементы.ОсновноеПомещение.СписокВыбора.НайтиПоЗначению(Объект.ОсновноеПомещение);
	
	Если НЕ НайденоеЗначение = Неопределено Тогда
		Объект.ОсновноеПомещение = НайденоеЗначение.Значение;
	КонецЕсли;

	ПутьКФайлуПДМ = омФайлы.ПолучитьПутьКФайлуПДМ(Объект.Ссылка, Объект.Проект, Объект.Наименование);
	
	Если ПустаяСтрока(ПутьКФайлуПДМ) Тогда
		Элементы.ОткрытьФайлПДМ.Видимость = Ложь;
	Иначе
		
		Файл = Новый Файл(ПутьКФайлуПДМ);
		
		Элементы.ОткрытьФайлПДМ.Видимость = Файл.Существует();
		
	КонецЕсли;
	
	
	НормаВремениПКДРКД 	= Ложь;
	
	стРеквизитыИзменненыеДляВыгрузки = Новый Структура();
	стРеквизитыИзменненыеДляВыгрузки.Вставить("Проект", 			Объект.Проект);
	стРеквизитыИзменненыеДляВыгрузки.Вставить("ГабаритныйЧертеж", 	Объект.ГабаритныйЧертеж);
	стРеквизитыИзменненыеДляВыгрузки.Вставить("Наименование", 		Объект.Наименование);
	
	ИзмененКонструктор = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВPDM(Команда)
	
	Если ЭтаФорма.Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо сохранить композицию");
		Возврат;
	КонецЕсли;
	
	стВозврата = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "Композиция");
	Если НЕ ПустаяСтрока(стВозврата.ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(, стВозврата.ОписаниеОшибки, , "Ошибка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКодPDM(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКодаПДМ", ЭтаФорма);
	
	Заголовок = ?(Код_в_PDM = 0, "Ввод кода PDM", "Изменение кода PDM");
	
	ПоказатьВводЧисла(Оповещение, Код_в_PDM, Заголовок, 10, 0); 

КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКодаПДМ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
	
		Возврат;	
	
	КонецЕсли;

	омКомпозицииСервер.УстановитьКодПДМДляКомпозиции(Объект.Ссылка, Результат);
	Код_в_PDM = Результат;
	
	Оповестить("Изменился_код_PDM_Композиция");

КонецПроцедуры // ПослеВводаКодаПДМ()

&НаКлиенте
Процедура НачалоТЗПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДнейТЗПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСтадияПриИзменении(Элемент)
	НормаВремениПКДРКД = Истина;
КонецПроцедуры


&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ИзмененКонструктор = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайлПДМ(Команда)
	ФайловаяСистемаКлиент.ОткрытьПроводник(ПутьКФайлуПДМ);
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПомещениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ОсновноеПомещение.СписокВыбора.ЗагрузитьЗначения(ПолучитьПомещенияОбъекта(Объект.Проект));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещенияОбъекта(Проект)
	Возврат Справочники.Помещения.ПолучитьПомещенияОбъекта(Проект);
КонецФункции // ПолучитьПомещенияОбъекта()

&НаКлиенте
Процедура ОткрытьТЗ(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

 &НаКлиенте
Процедура ЗагрузитьТЗ(Команда)
	
	ИмяФайлаПДФ = Объект.Наименование + ".ТЗ.pdf";
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл pdf|" + ИмяФайлаПДФ;
	Диалог.Заголовок = "Выберите файл ТЗ"; 
	Диалог.МножественныйВыбор = Ложь;
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	Диалог.Показать(ОповещениеЗавершения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныеФайлы = Неопределено Тогда
		
		ПутьКФайлу = ВыбранныеФайлы[0];
		
		стПараметры = Новый Структура("ПолноеИмяФайла, Версия", ПутьКФайлу, 1);
		
		Результат = омВыгрузкаCRMНаКлиенте.ВыгрузитьВPDM(Объект.Ссылка, "ЗагрузкаТЗ", стПараметры);
		
		Если НЕ ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
			Сообщить(Формат(ТекущаяДата(), "ДЛФ=DT") + " Не удалось перенести файла ТЗ " + стПараметры.ПолноеИмяФайла + ". " + Результат.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
